In [7]:
import pandas as pd

In [ ]:
dataFrame = pd.read_excel("./my discharge water level data.xlsx")
# dataFrame

loc = row onusary data find / slice korbey

data.loc[row_index, column_name]

In [14]:
loc_find = dataFrame.loc[0]
loc_find

Date         2012-01-01 00:00:00
Discharge                   10.0
WL                           2.0
Name: 0, dtype: object

In [15]:
loc_find = dataFrame.loc[5]
loc_find

Date         2012-01-06 00:00:00
Discharge                    NaN
WL                           7.0
Name: 5, dtype: object

In [16]:
loc_find = dataFrame.loc[[0,2]]
loc_find

        Date  Discharge   WL
0 2012-01-01       10.0  2.0
2 2012-01-03        NaN  4.0

In [17]:
loc_find = dataFrame.loc[[0,2,5,7,8,9]]
loc_find

        Date  Discharge    WL
0 2012-01-01       10.0   2.0
2 2012-01-03        NaN   4.0
5 2012-01-06        NaN   7.0
7 2012-01-08       80.0   9.0
8 2012-01-09        NaN  10.0
9 2012-01-10      100.0   NaN

In [18]:
loc_find = dataFrame.loc[4,'Discharge']
loc_find

50.0

In [22]:
loc_find = dataFrame.loc[7,'Discharge']
loc_find

80.0

In [24]:
loc_find = dataFrame.loc[[1,3,5],'Discharge']
loc_find

1    20.0
3    40.0
5     NaN
Name: Discharge, dtype: float64

In [26]:
loc_find = dataFrame.loc[1:5 ,'Discharge']
loc_find

1    20.0
2     NaN
3    40.0
4    50.0
5     NaN
Name: Discharge, dtype: float64

not working => sob gular jonno kora lagby aksathy. index same hotey hby

In [ ]:
# loc_find = dataFrame.loc[[False, False, True]]
# loc_find

In [33]:
loc_find = dataFrame.loc[ dataFrame["WL"]>10 ]
loc_find

         Date  Discharge    WL
10 2012-01-11      110.0  12.0
11 2012-01-12        NaN  13.0
12 2012-01-13      130.0  14.0
14 2012-01-15        NaN  16.0
15 2012-01-16      160.0  17.0
16 2012-01-17      170.0  18.0
17 2012-01-18      180.0  19.0
18 2012-01-19        NaN  20.0

In [35]:
loc_find = dataFrame.loc[ dataFrame["WL"]>10 ,'Discharge']
loc_find

10    110.0
11      NaN
12    130.0
14      NaN
15    160.0
16    170.0
17    180.0
18      NaN
Name: Discharge, dtype: float64

In [36]:
loc_find = dataFrame.loc[ dataFrame["WL"]>10 ,['Discharge']]
loc_find

    Discharge
10      110.0
11        NaN
12      130.0
14        NaN
15      160.0
16      170.0
17      180.0
18        NaN

In [39]:
loc_find = dataFrame.loc[1]
loc_find

Date         2012-01-02 00:00:00
Discharge                   20.0
WL                           NaN
Name: 1, dtype: object